---
title: MetallicPaint
classe: Autodesk.Revit.DB.Visual.MetallicPaint
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# MetallicPaint

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `MetallicPaint.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `MetallicPaint.CommonTintToggle` | String |
| `String MetallicpaintBaseColor { get; }` | `MetallicPaint.MetallicpaintBaseColor` | String |
| `String MetallicpaintBaseColorByObject { get; }` | `MetallicPaint.MetallicpaintBaseColorByObject` | String |
| `String MetallicpaintBaseHighlightspread { get; }` | `MetallicPaint.MetallicpaintBaseHighlightspread` | String |
| `String MetallicpaintFinish { get; }` | `MetallicPaint.MetallicpaintFinish` | String |
| `String MetallicpaintFinishPeelamount { get; }` | `MetallicPaint.MetallicpaintFinishPeelamount` | String |
| `String MetallicpaintFlecks { get; }` | `MetallicPaint.MetallicpaintFlecks` | String |
| `String MetallicpaintFlecksColor { get; }` | `MetallicPaint.MetallicpaintFlecksColor` | String |
| `String MetallicpaintFlecksColorByObject { get; }` | `MetallicPaint.MetallicpaintFlecksColorByObject` | String |
| `String MetallicpaintFlecksSize { get; }` | `MetallicPaint.MetallicpaintFlecksSize` | String |
| `String MetallicpaintPearl { get; }` | `MetallicPaint.MetallicpaintPearl` | String |
| `String MetallicpaintPearlAmount { get; }` | `MetallicPaint.MetallicpaintPearlAmount` | String |
| `String MetallicpaintPearlColor { get; }` | `MetallicPaint.MetallicpaintPearlColor` | String |
| `String MetallicpaintPearlColorByObject { get; }` | `MetallicPaint.MetallicpaintPearlColorByObject` | String |
| `String MetallicpaintPearlIor { get; }` | `MetallicPaint.MetallicpaintPearlIor` | String |
| `String MetallicpaintTopcoat { get; }` | `MetallicPaint.MetallicpaintTopcoat` | String |
| `String MetallicpaintTopcoatFalloff { get; }` | `MetallicPaint.MetallicpaintTopcoatFalloff` | String |
| `String MetallicpaintTopcoatGlossy { get; }` | `MetallicPaint.MetallicpaintTopcoatGlossy` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```